app/controllers/posts_controller.rb

  def create
    @post = Post.create
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Qwest"], ["description", "What is a qwest"], ["updated_at", "2020-08-27 03:45:12.953641"], ["id", 3]]